### terraform plan

<details><summary>Show output</summary>

```[command]/home/runner/work/_temp/5fb422c6-3e6a-4e99-abe1-ebfe169e43d3/terraform-bin plan -refresh=false -input=false -no-color

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_iam_user.ci will be destroyed
  - resource "aws_iam_user" "ci" {
      - arn           = "arn:aws:iam::946070829339:user/github-actions-ci" -> null
      - force_destroy = false -> null
      - id            = "github-actions-ci" -> null
      - name          = "github-actions-ci" -> null
      - path          = "/" -> null
      - tags          = {
          - "application"   = "Modernisation Platform"
          - "business-unit" = "Platforms"
          - "is-production" = "true"
          - "owner"         = "Modernisation Platform: modernisation-platform@digital.justice.gov.uk"
        } -> null
      - unique_id     = "AIDA5YRRXHEN546T6L4K6" -> null
    }

  # aws_iam_user_policy_attachment.ci will be destroyed
  - resource "aws_iam_user_policy_attachment" "ci" {
      - id         = "github-actions-ci-20201028100411250100000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess" -> null
      - user       = "github-actions-ci" -> null
    }

  # local_file.providers will be created
  + resource "local_file" "providers" {
      + content              = <<~EOT
            ## This file is automatically generated based on what regions are enabled in an AWS account.
            
            provider "aws" {
              region = "ap-northeast-1"
              alias  = "modernisation-platform-ap-northeast-1"
            }
            
            provider "aws" {
              region = "ap-northeast-2"
              alias  = "modernisation-platform-ap-northeast-2"
            }
            
            provider "aws" {
              region = "ap-south-1"
              alias  = "modernisation-platform-ap-south-1"
            }
            
            provider "aws" {
              region = "ap-southeast-1"
              alias  = "modernisation-platform-ap-southeast-1"
            }
            
            provider "aws" {
              region = "ap-southeast-2"
              alias  = "modernisation-platform-ap-southeast-2"
            }
            
            provider "aws" {
              region = "ca-central-1"
              alias  = "modernisation-platform-ca-central-1"
            }
            
            provider "aws" {
              region = "eu-central-1"
              alias  = "modernisation-platform-eu-central-1"
            }
            
            provider "aws" {
              region = "eu-north-1"
              alias  = "modernisation-platform-eu-north-1"
            }
            
            provider "aws" {
              region = "eu-west-1"
              alias  = "modernisation-platform-eu-west-1"
            }
            
            provider "aws" {
              region = "eu-west-2"
              alias  = "modernisation-platform-eu-west-2"
            }
            
            provider "aws" {
              region = "eu-west-3"
              alias  = "modernisation-platform-eu-west-3"
            }
            
            provider "aws" {
              region = "sa-east-1"
              alias  = "modernisation-platform-sa-east-1"
            }
            
            provider "aws" {
              region = "us-east-1"
              alias  = "modernisation-platform-us-east-1"
            }
            
            provider "aws" {
              region = "us-east-2"
              alias  = "modernisation-platform-us-east-2"
            }
            
            provider "aws" {
              region = "us-west-1"
              alias  = "modernisation-platform-us-west-1"
            }
            
            provider "aws" {
              region = "us-west-2"
              alias  = "modernisation-platform-us-west-2"
            }
            
            
            
            module "baselines-modernisation-platform" {
              source = "github.com/ministryofjustice/modernisation-platform-terraform-baselines"
              providers = {
                aws                = aws.modernisation-platform-eu-west-2
                aws.ap-northeast-1 = aws.modernisation-platform-ap-northeast-1
                aws.ap-northeast-2 = aws.modernisation-platform-ap-northeast-2
                aws.ap-south-1     = aws.modernisation-platform-ap-south-1
                aws.ap-southeast-1 = aws.modernisation-platform-ap-southeast-1
                aws.ap-southeast-2 = aws.modernisation-platform-ap-southeast-2
                aws.ca-central-1   = aws.modernisation-platform-ca-central-1
                aws.eu-central-1   = aws.modernisation-platform-eu-central-1
                aws.eu-north-1     = aws.modernisation-platform-eu-north-1
                aws.eu-west-1      = aws.modernisation-platform-eu-west-1
                aws.eu-west-2      = aws.modernisation-platform-eu-west-2
                aws.eu-west-3      = aws.modernisation-platform-eu-west-3
                aws.sa-east-1      = aws.modernisation-platform-sa-east-1
                aws.us-east-1      = aws.modernisation-platform-us-east-1
                aws.us-east-2      = aws.modernisation-platform-us-east-2
                aws.us-west-1      = aws.modernisation-platform-us-west-1
                aws.us-west-2      = aws.modernisation-platform-us-west-2
              }
              root_account_id = local.root_account.master_account_id
              tags            = local.global_resources
            }
        EOT
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./providers.tf"
      + id                   = (known after apply)
    }

  # module.auth0.aws_iam_saml_provider.auth0 will be updated in-place
  ~ resource "aws_iam_saml_provider" "auth0" {
        arn                    = "arn:aws:iam::946070829339:saml-provider/auth0"
        id                     = "arn:aws:iam::946070829339:saml-provider/auth0"
        name                   = "auth0"
      ~ saml_metadata_document = <<~EOT
          - <EntityDescriptor entityID="urn:justice-modernisation-platform.eu.auth0.com" xmlns="urn:oasis:names:tc:SAML:2.0:metadata"> <IDPSSODescriptor protocolSupportEnumeration="urn:oasis:names:tc:SAML:2.0:protocol"> <KeyDescriptor use="signing"> <KeyInfo xmlns="http://www.w3.org/2000/09/xmldsig#"> <X509Data> <X509Certificate>MIIDMTCCAhmgAwIBAgIJEC/qWE36BmQPMA0GCSqGSIb3DQEBCwUAMDYxNDAyBgNVBAMTK2p1c3RpY2UtbW9kZXJuaXNhdGlvbi1wbGF0Zm9ybS5ldS5hdXRoMC5jb20wHhcNMjAwODI0MTE0NjQzWhcNMzQwNTAzMTE0NjQzWjA2MTQwMgYDVQQDEytqdXN0aWNlLW1vZGVybmlzYXRpb24tcGxhdGZvcm0uZXUuYXV0aDAuY29tMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAqTlVZt5QnuicE1IgWuMeGEu8SYyABt77NAwQfaOlRp18dhviuS/xz45xlvRBYwmaFrF7RoUSt83ty/YdoB76xh0wbz5Z47X1hfwb4LdT0ygbiRMjFSVmfKweELG3yASYBGDzM5ou00Fv1+h5nkHJETdddI1y8bNpree1jCCzW1rdDkr0Nu174i2pmV3wYkmRju8WYw2MZP97P3nq8f0DB+4Ft08pI22mpKO5vRUEuHW3IcJU1ycDsHLjPnfQTVAIh6/jcpuwn7ALy+NtXWtwmyW0h0DLmPzVJQejSSjJNXkyVIoWOTXLGLfmlpA8WRWjtGEW9Ydkb393LNNv66x5iQIDAQABo0IwQDAPBgNVHRMBAf8EBTADAQH/MB0GA1UdDgQWBBSroy4UOMvud7t3UxhpkI4VN1DmczAOBgNVHQ8BAf8EBAMCAoQwDQYJKoZIhvcNAQELBQADggEBAGhjCBfrqm/J5kmVx4Azc81i6ZZqPAUZLIQD9Adgqr4ZAxuhpNpabKxy5HUhpI61vQST0F+oVgA2QDOPg2QiTe+U4VLVMsG3UaNq39+ewgBAjDI8XuMMSi7/H8jl3aiKYJkVkIvlAdAzoUSS4KVs7/DsRgzuJmbqZiBP3U5TPZnVUavXqqbeiPUPjPwJGN4ozdWcjkFGSjIZa+h6HrUjx7WwlgyezBRUnxUdclyYQM2j0RHjaAdpWenC0PYEiBzLe0pr1qhz1zlGVl3Dy0KRrTCkiFd9Q142/HemVvR+1SB/u7q9phkOQKXynd1hRiIuSW5CYGA2cv+k6ByGq/+95NA=</X509Certificate> </X509Data> </KeyInfo> </KeyDescriptor> <SingleLogoutService Binding="urn:oasis:names:tc:SAML:2.0:bindings:HTTP-Redirect" Location="https://justice-modernisation-platform.eu.auth0.com/samlp/jJJQKtCrkzXvzmKO94nUtgFgOylPrV23/logout"/> <SingleLogoutService Binding="urn:oasis:names:tc:SAML:2.0:bindings:HTTP-POST" Location="https://justice-modernisation-platform.eu.auth0.com/samlp/jJJQKtCrkzXvzmKO94nUtgFgOylPrV23/logout"/> <NameIDFormat>urn:oasis:names:tc:SAML:1.1:nameid-format:emailAddress</NameIDFormat> <NameIDFormat>urn:oasis:names:tc:SAML:2.0:nameid-format:persistent</NameIDFormat> <NameIDFormat>urn:oasis:names:tc:SAML:2.0:nameid-format:transient</NameIDFormat> <SingleSignOnService Binding="urn:oasis:names:tc:SAML:2.0:bindings:HTTP-Redirect" Location="https://justice-modernisation-platform.eu.auth0.com/samlp/jJJQKtCrkzXvzmKO94nUtgFgOylPrV23"/> <SingleSignOnService Binding="urn:oasis:names:tc:SAML:2.0:bindings:HTTP-POST" Location="https://justice-modernisation-platform.eu.auth0.com/samlp/jJJQKtCrkzXvzmKO94nUtgFgOylPrV23"/> <Attribute Name="http://schemas.xmlsoap.org/ws/2005/05/identity/claims/emailaddress" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri" FriendlyName="E-Mail Address" xmlns="urn:oasis:names:tc:SAML:2.0:assertion"/> <Attribute Name="http://schemas.xmlsoap.org/ws/2005/05/identity/claims/givenname" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri" FriendlyName="Given Name" xmlns="urn:oasis:names:tc:SAML:2.0:assertion"/> <Attribute Name="http://schemas.xmlsoap.org/ws/2005/05/identity/claims/name" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri" FriendlyName="Name" xmlns="urn:oasis:names:tc:SAML:2.0:assertion"/> <Attribute Name="http://schemas.xmlsoap.org/ws/2005/05/identity/claims/surname" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri" FriendlyName="Surname" xmlns="urn:oasis:names:tc:SAML:2.0:assertion"/> <Attribute Name="http://schemas.xmlsoap.org/ws/2005/05/identity/claims/nameidentifier" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri" FriendlyName="Name ID" xmlns="urn:oasis:names:tc:SAML:2.0:assertion"/> </IDPSSODescriptor> </EntityDescriptor>
          + <EntityDescriptor entityID="urn:justice-modernisation-platform.eu.auth0.com" xmlns="urn:oasis:names:tc:SAML:2.0:metadata">
          +   <IDPSSODescriptor protocolSupportEnumeration="urn:oasis:names:tc:SAML:2.0:protocol">
          +     <KeyDescriptor use="signing">
          +       <KeyInfo xmlns="http://www.w3.org/2000/09/xmldsig#">
          +         <X509Data>
          +           <X509Certificate>MIIDMTCCAhmgAwIBAgIJEC/qWE36BmQPMA0GCSqGSIb3DQEBCwUAMDYxNDAyBgNVBAMTK2p1c3RpY2UtbW9kZXJuaXNhdGlvbi1wbGF0Zm9ybS5ldS5hdXRoMC5jb20wHhcNMjAwODI0MTE0NjQzWhcNMzQwNTAzMTE0NjQzWjA2MTQwMgYDVQQDEytqdXN0aWNlLW1vZGVybmlzYXRpb24tcGxhdGZvcm0uZXUuYXV0aDAuY29tMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAqTlVZt5QnuicE1IgWuMeGEu8SYyABt77NAwQfaOlRp18dhviuS/xz45xlvRBYwmaFrF7RoUSt83ty/YdoB76xh0wbz5Z47X1hfwb4LdT0ygbiRMjFSVmfKweELG3yASYBGDzM5ou00Fv1+h5nkHJETdddI1y8bNpree1jCCzW1rdDkr0Nu174i2pmV3wYkmRju8WYw2MZP97P3nq8f0DB+4Ft08pI22mpKO5vRUEuHW3IcJU1ycDsHLjPnfQTVAIh6/jcpuwn7ALy+NtXWtwmyW0h0DLmPzVJQejSSjJNXkyVIoWOTXLGLfmlpA8WRWjtGEW9Ydkb393LNNv66x5iQIDAQABo0IwQDAPBgNVHRMBAf8EBTADAQH/MB0GA1UdDgQWBBSroy4UOMvud7t3UxhpkI4VN1DmczAOBgNVHQ8BAf8EBAMCAoQwDQYJKoZIhvcNAQELBQADggEBAGhjCBfrqm/J5kmVx4Azc81i6ZZqPAUZLIQD9Adgqr4ZAxuhpNpabKxy5HUhpI61vQST0F+oVgA2QDOPg2QiTe+U4VLVMsG3UaNq39+ewgBAjDI8XuMMSi7/H8jl3aiKYJkVkIvlAdAzoUSS4KVs7/DsRgzuJmbqZiBP3U5TPZnVUavXqqbeiPUPjPwJGN4ozdWcjkFGSjIZa+h6HrUjx7WwlgyezBRUnxUdclyYQM2j0RHjaAdpWenC0PYEiBzLe0pr1qhz1zlGVl3Dy0KRrTCkiFd9Q142/HemVvR+1SB/u7q9phkOQKXynd1hRiIuSW5CYGA2cv+k6ByGq/+95NA=</X509Certificate>
          +         </X509Data>
          +       </KeyInfo>
          +     </KeyDescriptor>
          +     <SingleLogoutService Binding="urn:oasis:names:tc:SAML:2.0:bindings:HTTP-Redirect" Location="https://justice-modernisation-platform.eu.auth0.com/samlp/jJJQKtCrkzXvzmKO94nUtgFgOylPrV23/logout"/>
          +     <SingleLogoutService Binding="urn:oasis:names:tc:SAML:2.0:bindings:HTTP-POST" Location="https://justice-modernisation-platform.eu.auth0.com/samlp/jJJQKtCrkzXvzmKO94nUtgFgOylPrV23/logout"/>
          +     <NameIDFormat>urn:oasis:names:tc:SAML:1.1:nameid-format:emailAddress</NameIDFormat>
          +     <NameIDFormat>urn:oasis:names:tc:SAML:2.0:nameid-format:persistent</NameIDFormat>
          +     <NameIDFormat>urn:oasis:names:tc:SAML:2.0:nameid-format:transient</NameIDFormat>
          +     <SingleSignOnService Binding="urn:oasis:names:tc:SAML:2.0:bindings:HTTP-Redirect" Location="https://justice-modernisation-platform.eu.auth0.com/samlp/jJJQKtCrkzXvzmKO94nUtgFgOylPrV23"/>
          +     <SingleSignOnService Binding="urn:oasis:names:tc:SAML:2.0:bindings:HTTP-POST" Location="https://justice-modernisation-platform.eu.auth0.com/samlp/jJJQKtCrkzXvzmKO94nUtgFgOylPrV23"/>
          +     <Attribute Name="http://schemas.xmlsoap.org/ws/2005/05/identity/claims/emailaddress" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri" FriendlyName="E-Mail Address" xmlns="urn:oasis:names:tc:SAML:2.0:assertion"/>
          +     <Attribute Name="http://schemas.xmlsoap.org/ws/2005/05/identity/claims/givenname" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri" FriendlyName="Given Name" xmlns="urn:oasis:names:tc:SAML:2.0:assertion"/>
          +     <Attribute Name="http://schemas.xmlsoap.org/ws/2005/05/identity/claims/name" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri" FriendlyName="Name" xmlns="urn:oasis:names:tc:SAML:2.0:assertion"/>
          +     <Attribute Name="http://schemas.xmlsoap.org/ws/2005/05/identity/claims/surname" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri" FriendlyName="Surname" xmlns="urn:oasis:names:tc:SAML:2.0:assertion"/>
          +     <Attribute Name="http://schemas.xmlsoap.org/ws/2005/05/identity/claims/nameidentifier" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri" FriendlyName="Name ID" xmlns="urn:oasis:names:tc:SAML:2.0:assertion"/>
          +   </IDPSSODescriptor>
          + </EntityDescriptor>
        EOT
        valid_until            = "Tue, 10 Sep 2120 08:58:54 UTC"
    }

  # module.baselines-modernisation-platform.data.aws_iam_policy_document.config-publish-policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "config-publish-policy"  {
      + id      = (known after apply)
      + json    = (known after apply)
      + version = "2012-10-17"

      + statement {
          + actions   = [
              + "s3:PutObject",
              + "s3:PutObjectAcl",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "bucket-owner-full-control",
                ]
              + variable = "s3:x-amz-acl"
            }
        }
      + statement {
          + actions   = [
              + "s3:GetBucketAcl",
              + "s3:ListBucket",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sns:ap-northeast-1:946070829339:config",
              + "arn:aws:sns:ap-northeast-2:946070829339:config",
              + "arn:aws:sns:ap-south-1:946070829339:config",
              + "arn:aws:sns:ap-southeast-1:946070829339:config",
              + "arn:aws:sns:ap-southeast-2:946070829339:config",
              + "arn:aws:sns:ca-central-1:946070829339:config",
              + "arn:aws:sns:eu-central-1:946070829339:config",
              + "arn:aws:sns:eu-north-1:946070829339:config",
              + "arn:aws:sns:eu-west-1:946070829339:config",
              + "arn:aws:sns:eu-west-2:946070829339:config",
              + "arn:aws:sns:eu-west-3:946070829339:config",
              + "arn:aws:sns:sa-east-1:946070829339:config",
              + "arn:aws:sns:us-east-1:946070829339:config",
              + "arn:aws:sns:us-east-2:946070829339:config",
              + "arn:aws:sns:us-west-1:946070829339:config",
              + "arn:aws:sns:us-west-2:946070829339:config",
            ]
        }
    }

  # module.baselines-modernisation-platform.data.aws_iam_policy_document.config-s3-policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "config-s3-policy"  {
      + id      = (known after apply)
      + json    = (known after apply)
      + version = "2012-10-17"

      + statement {
          + actions   = [
              + "s3:GetBucketAcl",
              + "s3:ListBucket",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "config.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "bucket-owner-full-control",
                ]
              + variable = "s3:x-amz-acl"
            }

          + principals {
              + identifiers = [
                  + "config.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
      + statement {
          + actions   = [
              + "s3:GetAccelerateConfiguration",
              + "s3:GetBucketAcl",
              + "s3:GetBucketCORS",
              + "s3:GetBucketLocation",
              + "s3:GetBucketLogging",
              + "s3:GetBucketNotification",
              + "s3:GetBucketPolicy",
              + "s3:GetBucketRequestPayment",
              + "s3:GetBucketTagging",
              + "s3:GetBucketVersioning",
              + "s3:GetBucketWebsite",
              + "s3:GetLifecycleConfiguration",
              + "s3:GetReplicationConfiguration",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::946070829339:role/AWSConfig",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "Require SSL"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.baselines-modernisation-platform.aws_iam_policy.config-publish-policy will be updated in-place
  ~ resource "aws_iam_policy" "config-publish-policy" {
        arn    = "arn:aws:iam::946070829339:policy/AWSConfigPublishPolicy"
        id     = "arn:aws:iam::946070829339:policy/AWSConfigPublishPolicy"
        name   = "AWSConfigPublishPolicy"
        path   = "/"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "s3:PutObjectAcl",
                          - "s3:PutObject",
                        ]
                      - Condition = {
                          - StringLike = {
                              - s3:x-amz-acl = "bucket-owner-full-control"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:s3:::config-20201009133419819400000001/AWSLogs/946070829339/*"
                      - Sid       = ""
                    },
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:GetBucketAcl",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::config-20201009133419819400000001"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "sns:Publish"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sns:us-west-2:946070829339:config",
                          - "arn:aws:sns:us-west-1:946070829339:config",
                          - "arn:aws:sns:us-east-2:946070829339:config",
                          - "arn:aws:sns:us-east-1:946070829339:config",
                          - "arn:aws:sns:sa-east-1:946070829339:config",
                          - "arn:aws:sns:eu-west-3:946070829339:config",
                          - "arn:aws:sns:eu-west-2:946070829339:config",
                          - "arn:aws:sns:eu-west-1:946070829339:config",
                          - "arn:aws:sns:eu-north-1:946070829339:config",
                          - "arn:aws:sns:eu-central-1:946070829339:config",
                          - "arn:aws:sns:ca-central-1:946070829339:config",
                          - "arn:aws:sns:ap-southeast-2:946070829339:config",
                          - "arn:aws:sns:ap-southeast-1:946070829339:config",
                          - "arn:aws:sns:ap-south-1:946070829339:config",
                          - "arn:aws:sns:ap-northeast-2:946070829339:config",
                          - "arn:aws:sns:ap-northeast-1:946070829339:config",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # module.baselines-modernisation-platform.aws_s3_bucket.config will be created
  + resource "aws_s3_bucket" "config" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "config-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "application"   = "Modernisation Platform"
          + "business-unit" = "Platforms"
          + "is-production" = "true"
          + "owner"         = "Modernisation Platform: modernisation-platform@digital.justice.gov.uk"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "aws:kms"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # module.baselines-modernisation-platform.aws_s3_bucket_policy.config will be created
  + resource "aws_s3_bucket_policy" "config" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.baselines-modernisation-platform.aws_s3_bucket_public_access_block.config will be created
  + resource "aws_s3_bucket_public_access_block" "config" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.baselines-modernisation-platform.module.backup.aws_backup_plan.default will be destroyed
  - resource "aws_backup_plan" "default" {
      - arn     = "arn:aws:backup:eu-west-2:946070829339:backup-plan:0714e6c5-8b89-41f0-a20e-95535903f391" -> null
      - id      = "0714e6c5-8b89-41f0-a20e-95535903f391" -> null
      - name    = "backup-daily-cold-storage-monthly-retain-120-days" -> null
      - tags    = {
          - "application"   = "Modernisation Platform"
          - "business-unit" = "Platforms"
          - "is-production" = "true"
          - "owner"         = "Modernisation Platform: modernisation-platform@digital.justice.gov.uk"
        } -> null
      - version = "NGFhZjlhZjktNjZkNi00YjVkLTg1NzgtNjQxMGU4MDI2YmE4" -> null

      - advanced_backup_setting {
          - backup_options = {
              - "WindowsVSS" = "enabled"
            } -> null
          - resource_type  = "EC2" -> null
        }

      - rule {
          - completion_window   = 180 -> null
          - recovery_point_tags = {} -> null
          - rule_name           = "backup-daily-cold-storage-monthly-retain-120-days" -> null
          - schedule            = "cron(30 0 * * ? *)" -> null
          - start_window        = 60 -> null
          - target_vault_name   = "everything" -> null

          - lifecycle {
              - cold_storage_after = 30 -> null
              - delete_after       = 120 -> null
            }
        }
    }

  # module.baselines-modernisation-platform.module.backup.aws_backup_vault.default will be destroyed
  - resource "aws_backup_vault" "default" {
      - arn             = "arn:aws:backup:eu-west-2:946070829339:backup-vault:everything" -> null
      - id              = "everything" -> null
      - kms_key_arn     = "arn:aws:kms:eu-west-2:946070829339:key/eb0dbb73-255c-4bb7-ad62-c878ee2d7c0c" -> null
      - name            = "everything" -> null
      - recovery_points = 0 -> null
      - tags            = {} -> null
    }

  # module.baselines-modernisation-platform.module.cloudtrail.data.aws_iam_policy_document.cloudtrail will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cloudtrail"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetBucketAcl",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "cloudtrail.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "bucket-owner-full-control",
                ]
              + variable = "s3:x-amz-acl"
            }

          + principals {
              + identifiers = [
                  + "cloudtrail.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "Require SSL"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.baselines-modernisation-platform.module.cloudtrail.aws_cloudtrail.cloudtrail will be updated in-place
  ~ resource "aws_cloudtrail" "cloudtrail" {
        arn                           = "arn:aws:cloudtrail:eu-west-2:946070829339:trail/cloudtrail"
        cloud_watch_logs_group_arn    = "arn:aws:logs:eu-west-2:946070829339:log-group:cloudtrail:*"
        cloud_watch_logs_role_arn     = "arn:aws:iam::946070829339:role/cloudtrail"
        enable_log_file_validation    = true
        enable_logging                = true
        home_region                   = "eu-west-2"
        id                            = "cloudtrail"
        include_global_service_events = true
        is_multi_region_trail         = true
        is_organization_trail         = false
        kms_key_id                    = "arn:aws:kms:eu-west-2:946070829339:key/15a7f85b-8d68-4acb-b003-80c3500f3439"
        name                          = "cloudtrail"
      ~ s3_bucket_name                = "cloudtrail-20201012165624180300000001" -> (known after apply)
        sns_topic_name                = "arn:aws:sns:eu-west-2:946070829339:cloudtrail"
        tags                          = {
            "application"   = "Modernisation Platform"
            "business-unit" = "Platforms"
            "is-production" = "true"
            "owner"         = "Modernisation Platform: modernisation-platform@digital.justice.gov.uk"
        }

        event_selector {
            include_management_events = true
            read_write_type           = "All"

            data_resource {
                type   = "AWS::S3::Object"
                values = [
                    "arn:aws:s3",
                ]
            }
        }
    }

  # module.baselines-modernisation-platform.module.cloudtrail.aws_s3_bucket.cloudtrail will be created
  + resource "aws_s3_bucket" "cloudtrail" {
      + acceleration_status         = (known after apply)
      + acl                         = "log-delivery-write"
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "cloudtrail-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "application"   = "Modernisation Platform"
          + "business-unit" = "Platforms"
          + "is-production" = "true"
          + "owner"         = "Modernisation Platform: modernisation-platform@digital.justice.gov.uk"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = (known after apply)

          + noncurrent_version_transition {
              + days          = 30
              + storage_class = "GLACIER"
            }

          + transition {
              + days          = 30
              + storage_class = "GLACIER"
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = "arn:aws:kms:eu-west-2:946070829339:key/15a7f85b-8d68-4acb-b003-80c3500f3439"
                  + sse_algorithm     = "aws:kms"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # module.baselines-modernisation-platform.module.cloudtrail.aws_s3_bucket_policy.cloudtrail will be created
  + resource "aws_s3_bucket_policy" "cloudtrail" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.baselines-modernisation-platform.module.cloudtrail.aws_s3_bucket_public_access_block.cloudtrail will be created
  + resource "aws_s3_bucket_public_access_block" "cloudtrail" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.baselines-modernisation-platform.module.config-ap-northeast-1.aws_config_delivery_channel.default will be updated in-place
  ~ resource "aws_config_delivery_channel" "default" {
        id             = "config"
        name           = "config"
      ~ s3_bucket_name = "config-20201009133419819400000001" -> (known after apply)
        sns_topic_arn  = "arn:aws:sns:ap-northeast-1:946070829339:config"

        snapshot_delivery_properties {
            delivery_frequency = "Three_Hours"
        }
    }

  # module.baselines-modernisation-platform.module.config-ap-northeast-2.aws_config_delivery_channel.default will be updated in-place
  ~ resource "aws_config_delivery_channel" "default" {
        id             = "config"
        name           = "config"
      ~ s3_bucket_name = "config-20201009133419819400000001" -> (known after apply)
        sns_topic_arn  = "arn:aws:sns:ap-northeast-2:946070829339:config"

        snapshot_delivery_properties {
            delivery_frequency = "Three_Hours"
        }
    }

  # module.baselines-modernisation-platform.module.config-ap-south-1.aws_config_delivery_channel.default will be updated in-place
  ~ resource "aws_config_delivery_channel" "default" {
        id             = "config"
        name           = "config"
      ~ s3_bucket_name = "config-20201009133419819400000001" -> (known after apply)
        sns_topic_arn  = "arn:aws:sns:ap-south-1:946070829339:config"

        snapshot_delivery_properties {
            delivery_frequency = "Three_Hours"
        }
    }

  # module.baselines-modernisation-platform.module.config-ap-southeast-1.aws_config_delivery_channel.default will be updated in-place
  ~ resource "aws_config_delivery_channel" "default" {
        id             = "config"
        name           = "config"
      ~ s3_bucket_name = "config-20201009133419819400000001" -> (known after apply)
        sns_topic_arn  = "arn:aws:sns:ap-southeast-1:946070829339:config"

        snapshot_delivery_properties {
            delivery_frequency = "Three_Hours"
        }
    }

  # module.baselines-modernisation-platform.module.config-ap-southeast-2.aws_config_delivery_channel.default will be updated in-place
  ~ resource "aws_config_delivery_channel" "default" {
        id             = "config"
        name           = "config"
      ~ s3_bucket_name = "config-20201009133419819400000001" -> (known after apply)
        sns_topic_arn  = "arn:aws:sns:ap-southeast-2:946070829339:config"

        snapshot_delivery_properties {
            delivery_frequency = "Three_Hours"
        }
    }

  # module.baselines-modernisation-platform.module.config-ca-central-1.aws_config_delivery_channel.default will be updated in-place
  ~ resource "aws_config_delivery_channel" "default" {
        id             = "config"
        name           = "config"
      ~ s3_bucket_name = "config-20201009133419819400000001" -> (known after apply)
        sns_topic_arn  = "arn:aws:sns:ca-central-1:946070829339:config"

        snapshot_delivery_properties {
            delivery_frequency = "Three_Hours"
        }
    }

  # module.baselines-modernisation-platform.module.config-eu-central-1.aws_config_delivery_channel.default will be updated in-place
  ~ resource "aws_config_delivery_channel" "default" {
        id             = "config"
        name           = "config"
      ~ s3_bucket_name = "config-20201009133419819400000001" -> (known after apply)
        sns_topic_arn  = "arn:aws:sns:eu-central-1:946070829339:config"

        snapshot_delivery_properties {
            delivery_frequency = "Three_Hours"
        }
    }

  # module.baselines-modernisation-platform.module.config-eu-north-1.aws_config_delivery_channel.default will be updated in-place
  ~ resource "aws_config_delivery_channel" "default" {
        id             = "config"
        name           = "config"
      ~ s3_bucket_name = "config-20201009133419819400000001" -> (known after apply)
        sns_topic_arn  = "arn:aws:sns:eu-north-1:946070829339:config"

        snapshot_delivery_properties {
            delivery_frequency = "Three_Hours"
        }
    }

  # module.baselines-modernisation-platform.module.config-eu-west-1.aws_config_delivery_channel.default will be updated in-place
  ~ resource "aws_config_delivery_channel" "default" {
        id             = "config"
        name           = "config"
      ~ s3_bucket_name = "config-20201009133419819400000001" -> (known after apply)
        sns_topic_arn  = "arn:aws:sns:eu-west-1:946070829339:config"

        snapshot_delivery_properties {
            delivery_frequency = "Three_Hours"
        }
    }

  # module.baselines-modernisation-platform.module.config-eu-west-2.aws_config_config_rule.cloudtrail-enabled[0] will be updated in-place
  ~ resource "aws_config_config_rule" "cloudtrail-enabled" {
        arn                         = "arn:aws:config:eu-west-2:946070829339:config-rule/config-rule-thxgzg"
        id                          = "cloudtrail-enabled"
      ~ input_parameters            = jsonencode(
            {
              - cloudWatchLogsLogGroupArn = "arn:aws:logs:eu-west-2:946070829339:log-group:cloudtrail:*"
              - s3BucketName              = "cloudtrail-20201012165624180300000001"
              - snsTopicArn               = "arn:aws:sns:eu-west-2:946070829339:cloudtrail"
            }
        ) -> (known after apply)
        maximum_execution_frequency = "TwentyFour_Hours"
        name                        = "cloudtrail-enabled"
        rule_id                     = "config-rule-thxgzg"
        tags                        = {
            "application"   = "Modernisation Platform"
            "business-unit" = "Platforms"
            "is-production" = "true"
            "owner"         = "Modernisation Platform: modernisation-platform@digital.justice.gov.uk"
        }

        source {
            owner             = "AWS"
            source_identifier = "CLOUD_TRAIL_ENABLED"
        }
    }

  # module.baselines-modernisation-platform.module.config-eu-west-2.aws_config_config_rule.multi-region-cloudtrail-enabled[0] will be updated in-place
  ~ resource "aws_config_config_rule" "multi-region-cloudtrail-enabled" {
        arn                         = "arn:aws:config:eu-west-2:946070829339:config-rule/config-rule-ey0z7c"
        id                          = "multi-region-cloudtrail-enabled"
      ~ input_parameters            = jsonencode(
            {
              - cloudWatchLogsLogGroupArn = "arn:aws:logs:eu-west-2:946070829339:log-group:cloudtrail:*"
              - includeManagementEvents   = "true"
              - readWriteType             = "ALL"
              - s3BucketName              = "cloudtrail-20201012165624180300000001"
              - snsTopicArn               = "arn:aws:sns:eu-west-2:946070829339:cloudtrail"
            }
        ) -> (known after apply)
        maximum_execution_frequency = "TwentyFour_Hours"
        name                        = "multi-region-cloudtrail-enabled"
        rule_id                     = "config-rule-ey0z7c"
        tags                        = {
            "application"   = "Modernisation Platform"
            "business-unit" = "Platforms"
            "is-production" = "true"
            "owner"         = "Modernisation Platform: modernisation-platform@digital.justice.gov.uk"
        }

        source {
            owner             = "AWS"
            source_identifier = "MULTI_REGION_CLOUD_TRAIL_ENABLED"
        }
    }

  # module.baselines-modernisation-platform.module.config-eu-west-2.aws_config_delivery_channel.default will be updated in-place
  ~ resource "aws_config_delivery_channel" "default" {
        id             = "config"
        name           = "config"
      ~ s3_bucket_name = "config-20201009133419819400000001" -> (known after apply)
        sns_topic_arn  = "arn:aws:sns:eu-west-2:946070829339:config"

        snapshot_delivery_properties {
            delivery_frequency = "Three_Hours"
        }
    }

  # module.baselines-modernisation-platform.module.config-eu-west-3.aws_config_delivery_channel.default will be updated in-place
  ~ resource "aws_config_delivery_channel" "default" {
        id             = "config"
        name           = "config"
      ~ s3_bucket_name = "config-20201009133419819400000001" -> (known after apply)
        sns_topic_arn  = "arn:aws:sns:eu-west-3:946070829339:config"

        snapshot_delivery_properties {
            delivery_frequency = "Three_Hours"
        }
    }

  # module.baselines-modernisation-platform.module.config-sa-east-1.aws_config_delivery_channel.default will be updated in-place
  ~ resource "aws_config_delivery_channel" "default" {
        id             = "config"
        name           = "config"
      ~ s3_bucket_name = "config-20201009133419819400000001" -> (known after apply)
        sns_topic_arn  = "arn:aws:sns:sa-east-1:946070829339:config"

        snapshot_delivery_properties {
            delivery_frequency = "Three_Hours"
        }
    }

  # module.baselines-modernisation-platform.module.config-us-east-1.aws_config_delivery_channel.default will be updated in-place
  ~ resource "aws_config_delivery_channel" "default" {
        id             = "config"
        name           = "config"
      ~ s3_bucket_name = "config-20201009133419819400000001" -> (known after apply)
        sns_topic_arn  = "arn:aws:sns:us-east-1:946070829339:config"

        snapshot_delivery_properties {
            delivery_frequency = "Three_Hours"
        }
    }

  # module.baselines-modernisation-platform.module.config-us-east-2.aws_config_delivery_channel.default will be updated in-place
  ~ resource "aws_config_delivery_channel" "default" {
        id             = "config"
        name           = "config"
      ~ s3_bucket_name = "config-20201009133419819400000001" -> (known after apply)
        sns_topic_arn  = "arn:aws:sns:us-east-2:946070829339:config"

        snapshot_delivery_properties {
            delivery_frequency = "Three_Hours"
        }
    }

  # module.baselines-modernisation-platform.module.config-us-west-1.aws_config_delivery_channel.default will be updated in-place
  ~ resource "aws_config_delivery_channel" "default" {
        id             = "config"
        name           = "config"
      ~ s3_bucket_name = "config-20201009133419819400000001" -> (known after apply)
        sns_topic_arn  = "arn:aws:sns:us-west-1:946070829339:config"

        snapshot_delivery_properties {
            delivery_frequency = "Three_Hours"
        }
    }

  # module.baselines-modernisation-platform.module.config-us-west-2.aws_config_delivery_channel.default will be updated in-place
  ~ resource "aws_config_delivery_channel" "default" {
        id             = "config"
        name           = "config"
      ~ s3_bucket_name = "config-20201009133419819400000001" -> (known after apply)
        sns_topic_arn  = "arn:aws:sns:us-west-2:946070829339:config"

        snapshot_delivery_properties {
            delivery_frequency = "Three_Hours"
        }
    }

  # module.baselines-modernisation-platform.module.s3_bucket.aws_s3_bucket.default will be destroyed
  - resource "aws_s3_bucket" "default" {
      - acl                         = "private" -> null
      - arn                         = "arn:aws:s3:::config-20201009133419819400000001" -> null
      - bucket                      = "config-20201009133419819400000001" -> null
      - bucket_domain_name          = "config-20201009133419819400000001.s3.amazonaws.com" -> null
      - bucket_prefix               = "config-" -> null
      - bucket_regional_domain_name = "config-20201009133419819400000001.s3.eu-west-2.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3GKZC51ZF0DB4" -> null
      - id                          = "config-20201009133419819400000001" -> null
      - region                      = "eu-west-2" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "application"   = "Modernisation Platform"
          - "business-unit" = "Platforms"
          - "is-production" = "true"
          - "owner"         = "Modernisation Platform: modernisation-platform@digital.justice.gov.uk"
        } -> null

      - server_side_encryption_configuration {
          - rule {
              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "aws:kms" -> null
                }
            }
        }

      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }
    }

  # module.baselines-modernisation-platform.module.s3_bucket.aws_s3_bucket_policy.default will be destroyed
  - resource "aws_s3_bucket_policy" "default" {
      - bucket = "config-20201009133419819400000001" -> null
      - id     = "config-20201009133419819400000001" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - aws:SecureTransport = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::config-20201009133419819400000001/*",
                          - "arn:aws:s3:::config-20201009133419819400000001",
                        ]
                      - Sid       = ""
                    },
                  - {
                      - Action    = [
                          - "s3:ListBucket",
                          - "s3:GetBucketAcl",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "config.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::config-20201009133419819400000001"
                      - Sid       = ""
                    },
                  - {
                      - Action    = "s3:PutObject"
                      - Condition = {
                          - StringEquals = {
                              - s3:x-amz-acl = "bucket-owner-full-control"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "config.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::config-20201009133419819400000001/AWSLogs/946070829339/Config/*"
                      - Sid       = ""
                    },
                  - {
                      - Action    = [
                          - "s3:GetReplicationConfiguration",
                          - "s3:GetLifecycleConfiguration",
                          - "s3:GetBucketWebsite",
                          - "s3:GetBucketVersioning",
                          - "s3:GetBucketTagging",
                          - "s3:GetBucketRequestPayment",
                          - "s3:GetBucketPolicy",
                          - "s3:GetBucketNotification",
                          - "s3:GetBucketLogging",
                          - "s3:GetBucketLocation",
                          - "s3:GetBucketCORS",
                          - "s3:GetBucketAcl",
                          - "s3:GetAccelerateConfiguration",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::946070829339:role/AWSConfig"
                        }
                      - Resource  = "arn:aws:s3:::config-20201009133419819400000001"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # module.baselines-modernisation-platform.module.s3_bucket.aws_s3_bucket_public_access_block.default will be destroyed
  - resource "aws_s3_bucket_public_access_block" "default" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "config-20201009133419819400000001" -> null
      - id                      = "config-20201009133419819400000001" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # module.baselines-modernisation-platform.module.cloudtrail.module.logging_bucket.aws_s3_bucket.default will be destroyed
  - resource "aws_s3_bucket" "default" {
      - acl                         = "log-delivery-write" -> null
      - arn                         = "arn:aws:s3:::log-bucket20201021155103839700000001" -> null
      - bucket                      = "log-bucket20201021155103839700000001" -> null
      - bucket_domain_name          = "log-bucket20201021155103839700000001.s3.amazonaws.com" -> null
      - bucket_prefix               = "log-bucket" -> null
      - bucket_regional_domain_name = "log-bucket20201021155103839700000001.s3.eu-west-2.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3GKZC51ZF0DB4" -> null
      - id                          = "log-bucket20201021155103839700000001" -> null
      - region                      = "eu-west-2" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "application"   = "Modernisation Platform"
          - "business-unit" = "Platforms"
          - "is-production" = "true"
          - "owner"         = "Modernisation Platform: modernisation-platform@digital.justice.gov.uk"
        } -> null

      - server_side_encryption_configuration {
          - rule {
              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "aws:kms" -> null
                }
            }
        }

      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }
    }

  # module.baselines-modernisation-platform.module.cloudtrail.module.logging_bucket.aws_s3_bucket_policy.default will be destroyed
  - resource "aws_s3_bucket_policy" "default" {
      - bucket = "log-bucket20201021155103839700000001" -> null
      - id     = "log-bucket20201021155103839700000001" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - aws:SecureTransport = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::log-bucket20201021155103839700000001/*",
                          - "arn:aws:s3:::log-bucket20201021155103839700000001",
                        ]
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # module.baselines-modernisation-platform.module.cloudtrail.module.logging_bucket.aws_s3_bucket_public_access_block.default will be destroyed
  - resource "aws_s3_bucket_public_access_block" "default" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "log-bucket20201021155103839700000001" -> null
      - id                      = "log-bucket20201021155103839700000001" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # module.baselines-modernisation-platform.module.cloudtrail.module.s3_bucket.aws_s3_bucket.default will be destroyed
  - resource "aws_s3_bucket" "default" {
      - acl                         = "log-delivery-write" -> null
      - arn                         = "arn:aws:s3:::cloudtrail-20201012165624180300000001" -> null
      - bucket                      = "cloudtrail-20201012165624180300000001" -> null
      - bucket_domain_name          = "cloudtrail-20201012165624180300000001.s3.amazonaws.com" -> null
      - bucket_prefix               = "cloudtrail-" -> null
      - bucket_regional_domain_name = "cloudtrail-20201012165624180300000001.s3.eu-west-2.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3GKZC51ZF0DB4" -> null
      - id                          = "cloudtrail-20201012165624180300000001" -> null
      - region                      = "eu-west-2" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "application"   = "Modernisation Platform"
          - "business-unit" = "Platforms"
          - "is-production" = "true"
          - "owner"         = "Modernisation Platform: modernisation-platform@digital.justice.gov.uk"
        } -> null

      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
          - enabled                                = true -> null
          - id                                     = "archive-after-30-days" -> null
          - tags                                   = {} -> null

          - noncurrent_version_transition {
              - days          = 30 -> null
              - storage_class = "GLACIER" -> null
            }

          - transition {
              - days          = 30 -> null
              - storage_class = "GLACIER" -> null
            }
        }

      - logging {
          - target_bucket = "log-bucket20201021155103839700000001" -> null
          - target_prefix = "cloudtrail/log" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - apply_server_side_encryption_by_default {
                  - kms_master_key_id = "arn:aws:kms:eu-west-2:946070829339:key/15a7f85b-8d68-4acb-b003-80c3500f3439" -> null
                  - sse_algorithm     = "aws:kms" -> null
                }
            }
        }

      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }
    }

  # module.baselines-modernisation-platform.module.cloudtrail.module.s3_bucket.aws_s3_bucket_policy.default will be destroyed
  - resource "aws_s3_bucket_policy" "default" {
      - bucket = "cloudtrail-20201012165624180300000001" -> null
      - id     = "cloudtrail-20201012165624180300000001" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - aws:SecureTransport = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::cloudtrail-20201012165624180300000001/*",
                          - "arn:aws:s3:::cloudtrail-20201012165624180300000001",
                        ]
                      - Sid       = ""
                    },
                  - {
                      - Action    = "s3:GetBucketAcl"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudtrail.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::cloudtrail-20201012165624180300000001"
                      - Sid       = ""
                    },
                  - {
                      - Action    = "s3:PutObject"
                      - Condition = {
                          - StringEquals = {
                              - s3:x-amz-acl = "bucket-owner-full-control"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudtrail.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::cloudtrail-20201012165624180300000001/AWSLogs/946070829339/*"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # module.baselines-modernisation-platform.module.cloudtrail.module.s3_bucket.aws_s3_bucket_public_access_block.default will be destroyed
  - resource "aws_s3_bucket_public_access_block" "default" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "cloudtrail-20201012165624180300000001" -> null
      - id                      = "cloudtrail-20201012165624180300000001" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

Plan: 7 to add, 21 to change, 13 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0AAn execution plan has been generated and is shown below.%0AResource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # aws_iam_user.ci will be destroyed%0A  - resource "aws_iam_user" "ci" {%0A      - arn           = "arn:aws:iam::946070829339:user/github-actions-ci" -> null%0A      - force_destroy = false -> null%0A      - id            = "github-actions-ci" -> null%0A      - name          = "github-actions-ci" -> null%0A      - path          = "/" -> null%0A      - tags          = {%0A          - "application"   = "Modernisation Platform"%0A          - "business-unit" = "Platforms"%0A          - "is-production" = "true"%0A          - "owner"         = "Modernisation Platform: modernisation-platform@digital.justice.gov.uk"%0A        } -> null%0A      - unique_id     = "AIDA5YRRXHEN546T6L4K6" -> null%0A    }%0A%0A  # aws_iam_user_policy_attachment.ci will be destroyed%0A  - resource "aws_iam_user_policy_attachment" "ci" {%0A      - id         = "github-actions-ci-20201028100411250100000001" -> null%0A      - policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess" -> null%0A      - user       = "github-actions-ci" -> null%0A    }%0A%0A  # local_file.providers will be created%0A  + resource "local_file" "providers" {%0A      + content              = <<~EOT%0A            ## This file is automatically generated based on what regions are enabled in an AWS account.%0A            %0A            provider "aws" {%0A              region = "ap-northeast-1"%0A              alias  = "modernisation-platform-ap-northeast-1"%0A            }%0A            %0A            provider "aws" {%0A              region = "ap-northeast-2"%0A              alias  = "modernisation-platform-ap-northeast-2"%0A            }%0A            %0A            provider "aws" {%0A              region = "ap-south-1"%0A              alias  = "modernisation-platform-ap-south-1"%0A            }%0A            %0A            provider "aws" {%0A              region = "ap-southeast-1"%0A              alias  = "modernisation-platform-ap-southeast-1"%0A            }%0A            %0A            provider "aws" {%0A              region = "ap-southeast-2"%0A              alias  = "modernisation-platform-ap-southeast-2"%0A            }%0A            %0A            provider "aws" {%0A              region = "ca-central-1"%0A              alias  = "modernisation-platform-ca-central-1"%0A            }%0A            %0A            provider "aws" {%0A              region = "eu-central-1"%0A              alias  = "modernisation-platform-eu-central-1"%0A            }%0A            %0A            provider "aws" {%0A              region = "eu-north-1"%0A              alias  = "modernisation-platform-eu-north-1"%0A            }%0A            %0A            provider "aws" {%0A              region = "eu-west-1"%0A              alias  = "modernisation-platform-eu-west-1"%0A            }%0A            %0A            provider "aws" {%0A              region = "eu-west-2"%0A              alias  = "modernisation-platform-eu-west-2"%0A            }%0A            %0A            provider "aws" {%0A              region = "eu-west-3"%0A              alias  = "modernisation-platform-eu-west-3"%0A            }%0A            %0A            provider "aws" {%0A              region = "sa-east-1"%0A              alias  = "modernisation-platform-sa-east-1"%0A            }%0A            %0A            provider "aws" {%0A              region = "us-east-1"%0A              alias  = "modernisation-platform-us-east-1"%0A            }%0A            %0A            provider "aws" {%0A              region = "us-east-2"%0A              alias  = "modernisation-platform-us-east-2"%0A            }%0A            %0A            provider "aws" {%0A              region = "us-west-1"%0A              alias  = "modernisation-platform-us-west-1"%0A            }%0A            %0A            provider "aws" {%0A              region = "us-west-2"%0A              alias  = "modernisation-platform-us-west-2"%0A            }%0A            %0A            %0A            %0A            module "baselines-modernisation-platform" {%0A              source = "github.com/ministryofjustice/modernisation-platform-terraform-baselines"%0A              providers = {%0A                aws                = aws.modernisation-platform-eu-west-2%0A                aws.ap-northeast-1 = aws.modernisation-platform-ap-northeast-1%0A                aws.ap-northeast-2 = aws.modernisation-platform-ap-northeast-2%0A                aws.ap-south-1     = aws.modernisation-platform-ap-south-1%0A                aws.ap-southeast-1 = aws.modernisation-platform-ap-southeast-1%0A                aws.ap-southeast-2 = aws.modernisation-platform-ap-southeast-2%0A                aws.ca-central-1   = aws.modernisation-platform-ca-central-1%0A                aws.eu-central-1   = aws.modernisation-platform-eu-central-1%0A                aws.eu-north-1     = aws.modernisation-platform-eu-north-1%0A                aws.eu-west-1      = aws.modernisation-platform-eu-west-1%0A                aws.eu-west-2      = aws.modernisation-platform-eu-west-2%0A                aws.eu-west-3      = aws.modernisation-platform-eu-west-3%0A                aws.sa-east-1      = aws.modernisation-platform-sa-east-1%0A                aws.us-east-1      = aws.modernisation-platform-us-east-1%0A                aws.us-east-2      = aws.modernisation-platform-us-east-2%0A                aws.us-west-1      = aws.modernisation-platform-us-west-1%0A                aws.us-west-2      = aws.modernisation-platform-us-west-2%0A              }%0A              root_account_id = local.root_account.master_account_id%0A              tags            = local.global_resources%0A            }%0A        EOT%0A      + directory_permission = "0777"%0A      + file_permission      = "0777"%0A      + filename             = "./providers.tf"%0A      + id                   = (known after apply)%0A    }%0A%0A  # module.auth0.aws_iam_saml_provider.auth0 will be updated in-place%0A  ~ resource "aws_iam_saml_provider" "auth0" {%0A        arn                    = "arn:aws:iam::946070829339:saml-provider/auth0"%0A        id                     = "arn:aws:iam::946070829339:saml-provider/auth0"%0A        name                   = "auth0"%0A      ~ saml_metadata_document = <<~EOT%0A          - <EntityDescriptor entityID="urn:justice-modernisation-platform.eu.auth0.com" xmlns="urn:oasis:names:tc:SAML:2.0:metadata"> <IDPSSODescriptor protocolSupportEnumeration="urn:oasis:names:tc:SAML:2.0:protocol"> <KeyDescriptor use="signing"> <KeyInfo xmlns="http://www.w3.org/2000/09/xmldsig#"> <X509Data> <X509Certificate>MIIDMTCCAhmgAwIBAgIJEC/qWE36BmQPMA0GCSqGSIb3DQEBCwUAMDYxNDAyBgNVBAMTK2p1c3RpY2UtbW9kZXJuaXNhdGlvbi1wbGF0Zm9ybS5ldS5hdXRoMC5jb20wHhcNMjAwODI0MTE0NjQzWhcNMzQwNTAzMTE0NjQzWjA2MTQwMgYDVQQDEytqdXN0aWNlLW1vZGVybmlzYXRpb24tcGxhdGZvcm0uZXUuYXV0aDAuY29tMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAqTlVZt5QnuicE1IgWuMeGEu8SYyABt77NAwQfaOlRp18dhviuS/xz45xlvRBYwmaFrF7RoUSt83ty/YdoB76xh0wbz5Z47X1hfwb4LdT0ygbiRMjFSVmfKweELG3yASYBGDzM5ou00Fv1+h5nkHJETdddI1y8bNpree1jCCzW1rdDkr0Nu174i2pmV3wYkmRju8WYw2MZP97P3nq8f0DB+4Ft08pI22mpKO5vRUEuHW3IcJU1ycDsHLjPnfQTVAIh6/jcpuwn7ALy+NtXWtwmyW0h0DLmPzVJQejSSjJNXkyVIoWOTXLGLfmlpA8WRWjtGEW9Ydkb393LNNv66x5iQIDAQABo0IwQDAPBgNVHRMBAf8EBTADAQH/MB0GA1UdDgQWBBSroy4UOMvud7t3UxhpkI4VN1DmczAOBgNVHQ8BAf8EBAMCAoQwDQYJKoZIhvcNAQELBQADggEBAGhjCBfrqm/J5kmVx4Azc81i6ZZqPAUZLIQD9Adgqr4ZAxuhpNpabKxy5HUhpI61vQST0F+oVgA2QDOPg2QiTe+U4VLVMsG3UaNq39+ewgBAjDI8XuMMSi7/H8jl3aiKYJkVkIvlAdAzoUSS4KVs7/DsRgzuJmbqZiBP3U5TPZnVUavXq```

</details>